templates/cves/cve-2021-26857-exchange-deserialization.yaml

name: CVE-2021-26857 Microsoft Exchange Unified Messaging Deserialization
description: Detects CVE-2021-26857, an insecure deserialization vulnerability in the Microsoft Exchange Unified Messaging service. Allows arbitrary code execution as SYSTEM via crafted serialized data in the ExchangeABRpc service.
severity: critical
cwe: CWE-502

requests:
  - method: GET
    path: /ews/exchange.asmx
  - method: POST
    path: /ews/exchange.asmx
    headers:
      Content-Type: text/xml; charset=utf-8
      SOAPAction: "http://schemas.microsoft.com/exchange/services/2006/messages/GetFolder"
    body: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:t=\"http://schemas.microsoft.com/exchange/services/2006/types\"><soap:Body><GetFolder xmlns=\"http://schemas.microsoft.com/exchange/services/2006/messages\"><FolderShape><t:BaseShape>Default</t:BaseShape></FolderShape><FolderIds><t:DistinguishedFolderId Id=\"inbox\"/></FolderIds></GetFolder></soap:Body></soap:Envelope>"
  - method: GET
    path: /autodiscover/autodiscover.xml

matchers:
  - status_code: 200
  - body_contains: "Exchange"
  - body_contains: "GetFolderResponse"

extractors:
  - name: exchange_version
    regex: "Exchange ([0-9.]+)"
